Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.1.45/atdf/PIC32MZ1024EFG100.atdf
         <register caption="" name="LATF" offset="0x530" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATF0"/>
            <bitfield mask="0x00000002" name="LATF1"/>
            <bitfield mask="0x00000004" name="LATF2"/>
            <bitfield mask="0x00000008" name="LATF3"/>
            <bitfield mask="0x00000010" name="LATF4"/>
            <bitfield mask="0x00000020" name="LATF5"/>
            <bitfield mask="0x00000040" name="LATF6"/>
            <bitfield mask="0x00000080" name="LATF7"/>
            <bitfield mask="0x00000100" name="LATF8"/>
            <bitfield mask="0x00000200" name="LATF9"/>
            <bitfield mask="0x00000400" name="LATF10"/>
            <bitfield mask="0x00000800" name="LATF11"/>
            <bitfield mask="0x00001000" name="LATF12"/>
            <bitfield mask="0x00002000" name="LATF13"/>
            <bitfield mask="0x00004000" name="LATF14"/>
            <bitfield mask="0x00008000" name="LATF15"/>
         </register>
         <register caption="" name="LATG" offset="0x630" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATG0"/>
            <bitfield mask="0x00000002" name="LATG1"/>
            <bitfield mask="0x00000004" name="LATG2"/>
            <bitfield mask="0x00000008" name="LATG3"/>
            <bitfield mask="0x00000010" name="LATG4"/>
            <bitfield mask="0x00000020" name="LATG5"/>
            <bitfield mask="0x00000040" name="LATG6"/>
            <bitfield mask="0x00000080" name="LATG7"/>
            <bitfield mask="0x00000100" name="LATG8"/>
            <bitfield mask="0x00000200" name="LATG9"/>
            <bitfield mask="0x00000400" name="LATG10"/>
            <bitfield mask="0x00000800" name="LATG11"/>
            <bitfield mask="0x00001000" name="LATG12"/>
            <bitfield mask="0x00002000" name="LATG13"/>
            <bitfield mask="0x00004000" name="LATG14"/>
            <bitfield mask="0x00008000" name="LATG15"/>
         </register>
         <register caption="" name="ODCA" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCA0"/>
            <bitfield mask="0x00000002" name="ODCA1"/>
            <bitfield mask="0x00000004" name="ODCA2"/>
            <bitfield mask="0x00000008" name="ODCA3"/>
            <bitfield mask="0x00000010" name="ODCA4"/>
            <bitfield mask="0x00000020" name="ODCA5"/>
            <bitfield mask="0x00000040" name="ODCA6"/>
            <bitfield mask="0x00000080" name="ODCA7"/>
            <bitfield mask="0x00000100" name="ODCA8"/>
            <bitfield mask="0x00000200" name="ODCA9"/>
            <bitfield mask="0x00000400" name="ODCA10"/>
            <bitfield mask="0x00000800" name="ODCA11"/>
            <bitfield mask="0x00001000" name="ODCA12"/>
            <bitfield mask="0x00002000" name="ODCA13"/>
            <bitfield mask="0x00004000" name="ODCA14"/>
            <bitfield mask="0x00008000" name="ODCA15"/>
         </register>
         <register caption="" name="ODCB" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCB0"/>
            <bitfield mask="0x00000002" name="ODCB1"/>
            <bitfield mask="0x00000004" name="ODCB2"/>
            <bitfield mask="0x00000008" name="ODCB3"/>
            <bitfield mask="0x00000010" name="ODCB4"/>
            <bitfield mask="0x00000020" name="ODCB5"/>
            <bitfield mask="0x00000040" name="ODCB6"/>
            <bitfield mask="0x00000080" name="ODCB7"/>
            <bitfield mask="0x00000100" name="ODCB8"/>
            <bitfield mask="0x00000200" name="ODCB9"/>
            <bitfield mask="0x00000400" name="ODCB10"/>
            <bitfield mask="0x00000800" name="ODCB11"/>
            <bitfield mask="0x00001000" name="ODCB12"/>
            <bitfield mask="0x00002000" name="ODCB13"/>
            <bitfield mask="0x00004000" name="ODCB14"/>
            <bitfield mask="0x00008000" name="ODCB15"/>
         </register>
         <register caption="" name="ODCC" offset="0x240" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCC0"/>
            <bitfield mask="0x00000002" name="ODCC1"/>
            <bitfield mask="0x00000004" name="ODCC2"/>
            <bitfield mask="0x00000008" name="ODCC3"/>
            <bitfield mask="0x00000010" name="ODCC4"/>
            <bitfield mask="0x00000020" name="ODCC5"/>
            <bitfield mask="0x00000040" name="ODCC6"/>
            <bitfield mask="0x00000080" name="ODCC7"/>
            <bitfield mask="0x00000100" name="ODCC8"/>
            <bitfield mask="0x00000200" name="ODCC9"/>
            <bitfield mask="0x00000400" name="ODCC10"/>
            <bitfield mask="0x00000800" name="ODCC11"/>
            <bitfield mask="0x00001000" name="ODCC12"/>
            <bitfield mask="0x00002000" name="ODCC13"/>
            <bitfield mask="0x00004000" name="ODCC14"/>
            <bitfield mask="0x00008000" name="ODCC15"/>
         </register>
         <register caption="" name="ODCD" offset="0x340" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCD0"/>
            <bitfield mask="0x00000002" name="ODCD1"/>
            <bitfield mask="0x00000004" name="ODCD2"/>
            <bitfield mask="0x00000008" name="ODCD3"/>
            <bitfield mask="0x00000010" name="ODCD4"/>
            <bitfield mask="0x00000020" name="ODCD5"/>
            <bitfield mask="0x00000040" name="ODCD6"/>
            <bitfield mask="0x00000080" name="ODCD7"/>
            <bitfield mask="0x00000100" name="ODCD8"/>
            <bitfield mask="0x00000200" name="ODCD9"/>
            <bitfield mask="0x00000400" name="ODCD10"/>
            <bitfield mask="0x00000800" name="ODCD11"/>
            <bitfield mask="0x00001000" name="ODCD12"/>
            <bitfield mask="0x00002000" name="ODCD13"/>
            <bitfield mask="0x00004000" name="ODCD14"/>
            <bitfield mask="0x00008000" name="ODCD15"/>
         </register>
         <register caption="" name="ODCE" offset="0x440" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCE0"/>
            <bitfield mask="0x00000002" name="ODCE1"/>
            <bitfield mask="0x00000004" name="ODCE2"/>
            <bitfield mask="0x00000008" name="ODCE3"/>
            <bitfield mask="0x00000010" name="ODCE4"/>
            <bitfield mask="0x00000020" name="ODCE5"/>
            <bitfield mask="0x00000040" name="ODCE6"/>
            <bitfield mask="0x00000080" name="ODCE7"/>
            <bitfield mask="0x00000100" name="ODCE8"/>
            <bitfield mask="0x00000200" name="ODCE9"/>
            <bitfield mask="0x00000400" name="ODCE10"/>
            <bitfield mask="0x00000800" name="ODCE11"/>
            <bitfield mask="0x00001000" name="ODCE12"/>
            <bitfield mask="0x00002000" name="ODCE13"/>
            <bitfield mask="0x00004000" name="ODCE14"/>
            <bitfield mask="0x00008000" name="ODCE15"/>
         </register>
         <register caption="" name="ODCF" offset="0x540" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCF0"/>
            <bitfield mask="0x00000002" name="ODCF1"/>
            <bitfield mask="0x00000004" name="ODCF2"/>
            <bitfield mask="0x00000008" name="ODCF3"/>
            <bitfield mask="0x00000010" name="ODCF4"/>
            <bitfield mask="0x00000020" name="ODCF5"/>
            <bitfield mask="0x00000040" name="ODCF6"/>
            <bitfield mask="0x00000080" name="ODCF7"/>
            <bitfield mask="0x00000100" name="ODCF8"/>
            <bitfield mask="0x00000200" name="ODCF9"/>
            <bitfield mask="0x00000400" name="ODCF10"/>
            <bitfield mask="0x00000800" name="ODCF11"/>
            <bitfield mask="0x00001000" name="ODCF12"/>
            <bitfield mask="0x00002000" name="ODCF13"/>
            <bitfield mask="0x00004000" name="ODCF14"/>
            <bitfield mask="0x00008000" name="ODCF15"/>
         </register>
         <register caption="" name="ODCG" offset="0x640" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCG0"/>
            <bitfield mask="0x00000002" name="ODCG1"/>
            <bitfield mask="0x00000004" name="ODCG2"/>
            <bitfield mask="0x00000008" name="ODCG3"/>
            <bitfield mask="0x00000010" name="ODCG4"/>
            <bitfield mask="0x00000020" name="ODCG5"/>
            <bitfield mask="0x00000040" name="ODCG6"/>
            <bitfield mask="0x00000080" name="ODCG7"/>
            <bitfield mask="0x00000100" name="ODCG8"/>
            <bitfield mask="0x00000200" name="ODCG9"/>
            <bitfield mask="0x00000400" name="ODCG10"/>
            <bitfield mask="0x00000800" name="ODCG11"/>
            <bitfield mask="0x00001000" name="ODCG12"/>
            <bitfield mask="0x00002000" name="ODCG13"/>
            <bitfield mask="0x00004000" name="ODCG14"/>
            <bitfield mask="0x00008000" name="ODCG15"/>
         </register>
         <register caption="" name="CNPUA" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUA0"/>
            <bitfield mask="0x00000002" name="CNPUA1"/>
            <bitfield mask="0x00000004" name="CNPUA2"/>
            <bitfield mask="0x00000008" name="CNPUA3"/>
            <bitfield mask="0x00000010" name="CNPUA4"/>
            <bitfield mask="0x00000020" name="CNPUA5"/>
            <bitfield mask="0x00000040" name="CNPUA6"/>
            <bitfield mask="0x00000080" name="CNPUA7"/>
            <bitfield mask="0x00000100" name="CNPUA8"/>
            <bitfield mask="0x00000200" name="CNPUA9"/>
            <bitfield mask="0x00000400" name="CNPUA10"/>
            <bitfield mask="0x00000800" name="CNPUA11"/>
            <bitfield mask="0x00001000" name="CNPUA12"/>
            <bitfield mask="0x00002000" name="CNPUA13"/>
            <bitfield mask="0x00004000" name="CNPUA14"/>
            <bitfield mask="0x00008000" name="CNPUA15"/>
         </register>
         <register caption="" name="CNPUB" offset="0x150" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUB0"/>
            <bitfield mask="0x00000002" name="CNPUB1"/>
            <bitfield mask="0x00000004" name="CNPUB2"/>
            <bitfield mask="0x00000008" name="CNPUB3"/>
            <bitfield mask="0x00000010" name="CNPUB4"/>
            <bitfield mask="0x00000020" name="CNPUB5"/>
            <bitfield mask="0x00000040" name="CNPUB6"/>
            <bitfield mask="0x00000080" name="CNPUB7"/>
            <bitfield mask="0x00000100" name="CNPUB8"/>
            <bitfield mask="0x00000200" name="CNPUB9"/>
            <bitfield mask="0x00000400" name="CNPUB10"/>
            <bitfield mask="0x00000800" name="CNPUB11"/>
            <bitfield mask="0x00001000" name="CNPUB12"/>
            <bitfield mask="0x00002000" name="CNPUB13"/>
            <bitfield mask="0x00004000" name="CNPUB14"/>
            <bitfield mask="0x00008000" name="CNPUB15"/>
         </register>
         <register caption="" name="CNPUC" offset="0x250" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUC0"/>
            <bitfield mask="0x00000002" name="CNPUC1"/>
            <bitfield mask="0x00000004" name="CNPUC2"/>
            <bitfield mask="0x00000008" name="CNPUC3"/>
            <bitfield mask="0x00000010" name="CNPUC4"/>
            <bitfield mask="0x00000020" name="CNPUC5"/>
            <bitfield mask="0x00000040" name="CNPUC6"/>
            <bitfield mask="0x00000080" name="CNPUC7"/>
            <bitfield mask="0x00000100" name="CNPUC8"/>
            <bitfield mask="0x00000200" name="CNPUC9"/>
            <bitfield mask="0x00000400" name="CNPUC10"/>
            <bitfield mask="0x00000800" name="CNPUC11"/>
            <bitfield mask="0x00001000" name="CNPUC12"/>
            <bitfield mask="0x00002000" name="CNPUC13"/>
            <bitfield mask="0x00004000" name="CNPUC14"/>
            <bitfield mask="0x00008000" name="CNPUC15"/>
         </register>
