Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.1.45/atdf/PIC32MZ1024EFG100.atdf
      <value-group caption="Receive Buffer Reset bit" name="SQI1CFG__RXBUFRST">
         <value caption="A reset pulse is generated clearing the receive buffer" name="" value="0x1"/>
         <value caption="A reset pulse is not generated" name="" value="0x0"/>
      </value-group>
      <value-group caption="Control Buffer Reset bit" name="SQI1CFG__CONBUFRST">
         <value caption="A reset pulse is generated, clearing the control buffer" name="" value="0x1"/>
         <value caption="A reset pulse is not generated" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Output Enable bits" name="SQI1CFG__DATAEN">
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="SQID3-SQID0 outputs are enabled" name="" value="0x2"/>
         <value caption="SQID1 and SQID0 data outputs are enabled" name="" value="0x1"/>
         <value caption="SQID0 data output is enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="SQI Enable bit" name="SQI1CFG__SQIEN">
         <value caption="SQI module is enabled" name="" value="0x1"/>
         <value caption="SQI module is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Chip Select Output Enable bits" name="SQI1CFG__CSEN">
         <value caption="Chip Select 0 and Chip Select 1 are used" name="" value="0x3"/>
         <value caption="Chip Select 1 is used (Chip Select 0 is not used)" name="" value="0x2"/>
         <value caption="Chip Select 0 is used (Chip Select 1 is not used)" name="" value="0x1"/>
         <value caption="Chip Select 0 and Chip Select 1 are not used" name="" value="0x0"/>
      </value-group>
      <value-group caption="SQI Device Select bits" name="SQI1CON__DEVSEL">
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Reserved" name="" value="0x2"/>
         <value caption="Select Device 1" name="" value="0x1"/>
         <value caption="Select Device 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Chip Select Assert bit" name="SQI1CON__DASSERT">
         <value caption="Chip Select is deasserted after transmission or reception of the specified number of bytes" name="" value="0x1"/>
         <value caption="Chip Select is not deasserted after transmission or reception of the specified number of bytes" name="" value="0x0"/>
      </value-group>
      <value-group caption="Double Data Rate Mode bit" name="SQI1CON__DDRMODE">
         <value caption="Set the SQI transfers to DDR mode" name="" value="0x1"/>
         <value caption="Set the SQI transfers to SDR mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Flash Status Check bit" name="SQI1CON__SCHECK">
         <value caption="Check the status of the Flash" name="" value="0x1"/>
         <value caption="Do not check the status of the Flash" name="" value="0x0"/>
      </value-group>
      <value-group caption="Tsqi Clock Enable Select bit" name="SQI1CLKCON__EN">
         <value caption="Enable the SQI clock (Tsqi)" name="" value="0x1"/>
         <value caption="Disable the SQI clock (Tsqi)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Tsqi Clock Stable Select bit" name="SQI1CLKCON__STABLE">
         <value caption="Tsqi clock is stable" name="" value="0x1"/>
         <value caption="Tsqi clock is not stable" name="" value="0x0"/>
      </value-group>
      <value-group caption="SQI Clock Tsqi Frequency Select bits" name="SQI1CLKCON__CLKDIV">
         <value caption="Base Clock Tbc is divided by 2048" name="" value="0x200"/>
         <value caption="Base Clock Tbc is divided by 1024" name="" value="0x100"/>
         <value caption="Base Clock Tbc is divided by 512" name="" value="0x80"/>
         <value caption="Base Clock Tbc is divided by 256" name="" value="0x40"/>
         <value caption="Base Clock Tbc is divided by 128" name="" value="0x20"/>
         <value caption="Base Clock Tbc is divided by 64" name="" value="0x10"/>
         <value caption="Base Clock Tbc is divided by 32" name="" value="0x8"/>
         <value caption="Base Clock Tbc is divided by 16" name="" value="0x4"/>
         <value caption="Base Clock Tbc is divided by 8" name="" value="0x2"/>
         <value caption="Base clock Tbc is divided by 4" name="" value="0x1"/>
         <value caption="Base clock Tbc is divided by 2" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Buffer Empty Interrupt Enable bit" name="SQI1INTEN__TXEMPTYIE">
         <value caption="Interrupt is enabled" name="" value="0x1"/>
         <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Buffer Full Interrupt Enable bit" name="SQI1INTEN__TXFULLIE">
         <value caption="Interrupt is enabled" name="" value="0x1"/>
         <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Buffer Threshold Interrupt Enable bit" name="SQI1INTEN__TXTHRIE">
         <value caption="Interrupt is enabled" name="" value="0x1"/>
         <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Empty Interrupt Enabled bit" name="SQI1INTEN__RXEMPTYIE">
         <value caption="Interrupt is enabled" name="" value="0x1"/>
         <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Full Interrupt Enable bit" name="SQI1INTEN__RXFULLIE">
         <value caption="Interrupt is enabled" name="" value="0x1"/>
         <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Threshold Interrupt Enable bit" name="SQI1INTEN__RXTHRIE">
         <value caption="Interrupt is enabled" name="" value="0x1"/>
         <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Control Buffer Full Interrupt Enable bit" name="SQI1INTEN__CONFULLIE">
         <value caption="Interrupt is enabled" name="" value="0x1"/>
         <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
